# Table of Contents

### 1. [Create Pandas DataFrame](#1)  
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 1: from lists of lists](#1)  
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 2: from a dictionary of lists](#2)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 3: from a list of dictionaries](#3)  
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 4: from lists using zip](#4)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 5: from a dictionary of Series](#5)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 6. from a dictionary of numpy arrays](#6)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 7. from numpy arrays](#7)
### 2. [Select rows and columns](#8)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 1: with loc](#8)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 2: with iloc](#9)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 3: with row names or indices](#10)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 4: with column names](#11)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 5: with .columns or .index method](#12)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 6: with boolean indexing](#13)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 7: with .filter method](#14)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 8: with .query method](#15)
### 3. [Delete rows and columns](#16)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 1: .drop method](#16)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 2: del](#17)
### 4. [Change row or column names](#18)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 1: with .rename](#18)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 2: with .set_axis](#19)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 3: directly assign .columns or .index](#20)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Method 4: promote a column to be the index](#21)
### 5. [Missing values](#22)
### 6. [Create a new column based on a condition](#23)
### 7. [Count](#24)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Count unique values](#24)
#### &nbsp;&nbsp;&nbsp;&nbsp;- [Count specific values](#25)

In [1]:
import numpy as np
import pandas as pd
%autosave 0

Autosave disabled

<a id=1></a>
# Create Pandas DataFrame
## Method 1: from lists of lists

In [2]:
data = [['tom', 10, 155], ['nick', 15, 169], ['juli', 14, 160]] # each list is a row
df1 = pd.DataFrame(data, columns = ['Name', 'Age', 'Height'], index = ['Row 1', 'Row 2', 'Row 3']) 
df1

       Name  Age  Height
Row 1   tom   10     155
Row 2  nick   15     169
Row 3  juli   14     160

<a id=2></a>
## Method 2. from a dictionary of lists

In [3]:
data = {'Name':['tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]} # each element is a column, which has to be the same length
df = pd.DataFrame(data, index = ['Row 1', 'Row 2', 'Row 3', 'Row 4'])
df

        Name  Age
Row 1    tom   20
Row 2   nick   21
Row 3  krish   19
Row 4   jack   18

<a id=3></a>
## Method 3: from a list of dictionaries

In [4]:
data = [{'b': 2, 'c':3}, {'a':10, 'b': 20, 'c': 30}] 
df = pd.DataFrame(data, columns = ['a', 'b', 'c'], index = ['first','second'])
df

           a   b   c
first    NaN   2   3
second  10.0  20  30

<a id=4></a>
## Method 4: from lists using zip

In [5]:
Name = ['tom', 'krish', 'nick', 'juli']  
Age = [25, 30, 26, 22]  
list_of_tuples = list(zip(Name, Age))  
list_of_tuples

[('tom', 25), ('krish', 30), ('nick', 26), ('juli', 22)]

In [6]:
df = pd.DataFrame(list_of_tuples, columns = ['Name', 'Age'], index = ['a', 'b', 'c', 'd'])
df

    Name  Age
a    tom   25
b  krish   30
c   nick   26
d   juli   22

<a id=5></a>
## Method 5: from a dictionary of Series

In [7]:
df3 = {'Column 1' : pd.Series([10, 20, 30, 40], index =['Row 1', 'Row 2', 'Row 3', 'Row 4']), 
      'two' : pd.Series([10, 20, 30, 40], index =['a', 'b', 'c', 'd'])} #indexes don't have to be the same
df3 = pd.DataFrame(df3)
df3

       Column 1   two
Row 1      10.0   NaN
Row 2      20.0   NaN
Row 3      30.0   NaN
Row 4      40.0   NaN
a           NaN  10.0
b           NaN  20.0
c           NaN  30.0
d           NaN  40.0

In [8]:
series1 = pd.Series(['Emma', 'Oliver', 'Harry', 'Sophia'])
series2 = pd.Series([29, 25, 33, 24])
series3 = pd.Series(['HR', 'Finance', 'Marketing', 'IT'])
dictionary_of_nparray = {'Name': series1, 'Age': series2, 'Department':series3}
df2 = pd.DataFrame(dictionary_of_nparray)
df2

     Name  Age Department
0    Emma   29         HR
1  Oliver   25    Finance
2   Harry   33  Marketing
3  Sophia   24         IT

<a id=6></a>
## Method 6. from a dictionary of numpy arrays

In [9]:
nparray = np.array(
    [['Emma', 'Oliver', 'Harry', 'Sophia'],
     [29, 25, 33, 24],
     ['HR', 'Finance', 'Marketing', 'IT']])
dictionary_of_nparray = {
    'Name': nparray[0],
    'Age': nparray[1],
    'Department': nparray[2]}
df = pd.DataFrame(dictionary_of_nparray)
df

     Name Age Department
0    Emma  29         HR
1  Oliver  25    Finance
2   Harry  33  Marketing
3  Sophia  24         IT

<a id=7></a>
## Method 7. from numpy arrays

In [10]:
data = np.random.randint(1,100,16)
data.resize(4,4)
rows = ['Row 1', 'Row 2', 'Row 3', 'Row 4']
columns = ['Column 1', 'Column 2', 'Column 3' ,'Column 4']
df = pd.DataFrame(data = data, index = rows, columns = columns)
df

       Column 1  Column 2  Column 3  Column 4
Row 1        77        80        19        50
Row 2        46        60        15        11
Row 3        97        59        54        81
Row 4         7        85        58        92

In [11]:
pd.DataFrame(np.random.random(10) for x in range(10))

,0,1,2,3,4,5,6,7,8,9
0,0.896228,0.353961,0.827595,0.887582,0.674214,0.770494,0.848282,0.941316,0.912338,0.263021
1,0.895815,0.473284,0.016295,0.941681,0.729505,0.396540,0.181268,0.680461,0.938172,0.337693
2,0.986746,0.561693,0.419523,0.823309,0.912828,0.691365,0.526941,0.755636,0.519085,0.360946
3,0.388832,0.942358,0.932840,0.881910,0.258416,0.598799,0.334054,0.830229,0.768250,0.404079
4,0.679665,0.010453,0.440410,0.443397,0.388472,0.571570,0.535205,0.041455,0.904644,0.379872
5,0.693275,0.676639,0.290267,0.775193,0.595384,0.816839,0.213198,0.166574,0.407809,0.245219
6,0.635739,0.532087,0.038277,0.907044,0.150891,0.346039,0.169410,0.775179,0.917435,0.252196
7,0.437058,0.229914,0.567657,0.640790,0.521955,0.614180,0.066436,0.202466,0.963677,0.225305
8,0.020448,0.578782,0.896193,0.422132,0.754692,0.408094,0.831082,0.836619,0.038781,0.553758
9,0.964479,0.430997,0.203453,0.989865,0.076968,0.490520,0.487736,0.298204,0.056206,0.200901

<a id=8></a>
# Select rows and columns
## Method 1: with loc
selection = df.loc[a:b,x:y]

a:b could be single row ("Row 1"), list of rows (["Row 1","Row 2"]), or slice of rows (["Row 1":"Row 3"])

x:y could be single column ("Column 1"), list of columns (["Columns 1","Columns 2"]), or slice of columns (["Columns 1":"Columns 3"])

In [12]:
df.loc['Row 1':'Row 2','Column 3':] # slicing with name is inclusive

       Column 3  Column 4
Row 1        19        50
Row 2        15        11

<a id=9></a>
## Method 2: with iloc
selection = df.iloc[a:b,x:y]

a:b could be single row (0), list of rows ([0,1]), or slice of rows ([0:2])

x:y could be single column (1), list of columns ([1,2]), or slice of columns ([1:3])

### selecting both rows and columns

In [13]:
df.iloc[0:2,1:3] # slicing with number is not inclusive

       Column 2  Column 3
Row 1        80        19
Row 2        60        15

### selecting only rows

In [14]:
df.iloc[0:2,] # column selection is omitted, same as df.iloc[0:2,:]

       Column 1  Column 2  Column 3  Column 4
Row 1        77        80        19        50
Row 2        46        60        15        11

In [15]:
df.iloc[0:2] # same result as above, but very confusing syntax

       Column 1  Column 2  Column 3  Column 4
Row 1        77        80        19        50
Row 2        46        60        15        11

In [16]:
df.iloc[2] # same as df.iloc[2,] and df.iloc[2,:], selecting a single row, structure is lost

Column 1    97
Column 2    59
Column 3    54
Column 4    81
Name: Row 3, dtype: int32

In [17]:
df.iloc[[2]] # to preserve structure, use double brackets

       Column 1  Column 2  Column 3  Column 4
Row 3        97        59        54        81

### selecting only columns

In [18]:
df.iloc[:,3] # cannot omit ':' and','

Row 1    50
Row 2    11
Row 3    81
Row 4    92
Name: Column 4, dtype: int32

In [19]:
df.iloc[:,3:4] # to preserve structure, use slicing

       Column 4
Row 1        50
Row 2        11
Row 3        81
Row 4        92

<a id=10></a>
## Method 3: with row names or indices
This method can only select multiple rows

In [20]:
df["Row 1":"Row 3"] # slicing with name is inclusive

       Column 1  Column 2  Column 3  Column 4
Row 1        77        80        19        50
Row 2        46        60        15        11
Row 3        97        59        54        81

In [21]:
df[1:3] # slicing with number is not inclusive

       Column 1  Column 2  Column 3  Column 4
Row 2        46        60        15        11
Row 3        97        59        54        81

<a id=11></a>
## Method 4: with column names
This method can only select columns

### selecting a single column

In [22]:
df['Column 1']

Row 1    77
Row 2    46
Row 3    97
Row 4     7
Name: Column 1, dtype: int32

In [23]:
df[['Column 1']] # use double brackets to preserve structure

       Column 1
Row 1        77
Row 2        46
Row 3        97
Row 4         7

In [24]:
df1.Name

Row 1     tom
Row 2    nick
Row 3    juli
Name: Name, dtype: object

Using the dot method like above is not recommended (while it’s easier to type). This is because you can’t:
- Select columns with spaces in the name,
- Use columns that have the same names as dataframe methods (such as ‘type’),
- Pick columns that aren’t strings, and
- Select multiple columns.

### selecting multiple columns

In [25]:
df[['Column 2','Column 1']] # can switch the order

       Column 2  Column 1
Row 1        80        77
Row 2        60        46
Row 3        59        97
Row 4        85         7

<a id=12></a>
## Method 5: with .columns or .index method

In [26]:
df.columns # returns column indexes

Index(['Column 1', 'Column 2', 'Column 3', 'Column 4'], dtype='object')

In [27]:
df[df.columns[1:3]] # can select single or multiple columns (with slicing)

       Column 2  Column 3
Row 1        80        19
Row 2        60        15
Row 3        59        54
Row 4        85        58

<a id=13></a>
## Method 6: with boolean indexing

In [28]:
df[df['Column 1']>50]

       Column 1  Column 2  Column 3  Column 4
Row 1        77        80        19        50
Row 3        97        59        54        81

Although all of the above methods returns a copy of the dataframe, if it is assigned to a variable, a reference to the dataframe is created so that changes made to the variable also apply to the original dataframe!

To avoid this, use the .copy() method to create a brand new object, that isn’t just a reference to the original.

In [29]:
selection = df['Column 1'].copy()

<a id=14></a>
## Method 7: with .filter method

In [45]:
# select columns by name
df1.filter(items=['Name','Age']) # axis=0 for rows, axis=1 for columns

       Name  Age
Row 1   tom   10
Row 2  nick   15
Row 3  juli   14

In [44]:
# select columns by regular expression
df1.filter(regex='e$',axis=1)

       Name  Age
Row 1   tom   10
Row 2  nick   15
Row 3  juli   14

In [46]:
# select rows containing "ow"
df1.filter(like='ow',axis=0)

       Name  Age  Height
Row 1   tom   10     155
Row 2  nick   15     169
Row 3  juli   14     160

<a id=15></a>
## Method 8: with .query method

In [53]:
df1.query('Age>11 and Name=="nick"')

       Name  Age  Height
Row 2  nick   15     169

<a id=16></a>
# Delete rows or columns
## Method 1: .drop method
returns a copy

In [43]:
print(df.drop('Column 4',axis = 1))
print(df.drop('Row 4', axis = 0))

       Column 1  Column 2  Column 3
Row 1         9        30        18
Row 2        79        15        47
Row 3        33        71        41
Row 4        94        90        81
       Column 1  Column 2  Column 3  Column 4
Row 1         9        30        18        70
Row 2        79        15        47        52
Row 3        33        71        41        24

<a id=17></a>
## Method 2: del
takes immediate effect on the object itself

In [44]:
df_copy = df.copy()
del df_copy['Column 4']
df_copy

       Column 1  Column 2  Column 3
Row 1         9        30        18
Row 2        79        15        47
Row 3        33        71        41
Row 4        94        90        81

<a id=18></a>
# Change row or column names
## Method 1: with .rename
returns a copy

In [45]:
df.rename(columns = {'Column 1': 'Column_1'}, index = {'Row 1': 'Row_1'})

       Column_1  Column 2  Column 3  Column 4
Row_1         9        30        18        70
Row 2        79        15        47        52
Row 3        33        71        41        24
Row 4        94        90        81        19

In [46]:
print(df.rename(mapper = str.lower)) # default axis is rows
print(df.rename(mapper = str.lower, axis = 'columns'))
print(df.rename(index = lambda x:x.upper()))

       Column 1  Column 2  Column 3  Column 4
row 1         9        30        18        70
row 2        79        15        47        52
row 3        33        71        41        24
row 4        94        90        81        19
       column 1  column 2  column 3  column 4
Row 1         9        30        18        70
Row 2        79        15        47        52
Row 3        33        71        41        24
Row 4        94        90        81        19
       Column 1  Column 2  Column 3  Column 4
ROW 1         9        30        18        70
ROW 2        79        15        47        52
ROW 3        33        71        41        24
ROW 4        94        90        81        19

<a id=19></a>
## Method 2: with .set_axis
returns a copy

In [47]:
print(df.set_axis(['I','II','III','IV'], axis = 'columns'))
print(df.set_axis(['One','Two','Three','Four'], axis = 'index'))

        I  II  III  IV
Row 1   9  30   18  70
Row 2  79  15   47  52
Row 3  33  71   41  24
Row 4  94  90   81  19
       Column 1  Column 2  Column 3  Column 4
One           9        30        18        70
Two          79        15        47        52
Three        33        71        41        24
Four         94        90        81        19

<a id=20></a>
## Method 3: directly assign .columns or .index
makes changes on the object itself

In [48]:
cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns=cols
df

       column 1  column 2  column 3  column 4
Row 1         9        30        18        70
Row 2        79        15        47        52
Row 3        33        71        41        24
Row 4        94        90        81        19

<a id=21></a>
## Method 4: promote a column to be the index

In [49]:
print(df1)
print(df1.set_index('Name')) # original indexes are dropped

       Name  Age  Height
Row 1   tom   10     155
Row 2  nick   15     169
Row 3  juli   14     160
      Age  Height
Name
tom    10     155
nick   15     169
juli   14     160

In [50]:
df1_copy = df1.set_index('Name')
df1_copy.reset_index() # reset the index to default

   Name  Age  Height
0   tom   10     155
1  nick   15     169
2  juli   14     160

<a id=22></a>
# Missing values

In [51]:
df3

       Column 1   two
Row 1      10.0   NaN
Row 2      20.0   NaN
Row 3      30.0   NaN
Row 4      40.0   NaN
a           NaN  10.0
b           NaN  20.0
c           NaN  30.0
d           NaN  40.0

In [52]:
df3.isnull()

       Column 1    two
Row 1     False   True
Row 2     False   True
Row 3     False   True
Row 4     False   True
a          True  False
b          True  False
c          True  False
d          True  False

In [53]:
df3.fillna(0)

       Column 1   two
Row 1      10.0   0.0
Row 2      20.0   0.0
Row 3      30.0   0.0
Row 4      40.0   0.0
a           0.0  10.0
b           0.0  20.0
c           0.0  30.0
d           0.0  40.0

In [54]:
df3.fillna(method = 'ffill')

       Column 1   two
Row 1      10.0   NaN
Row 2      20.0   NaN
Row 3      30.0   NaN
Row 4      40.0   NaN
a          40.0  10.0
b          40.0  20.0
c          40.0  30.0
d          40.0  40.0

In [55]:
df3.fillna(method = 'bfill')

       Column 1   two
Row 1      10.0  10.0
Row 2      20.0  10.0
Row 3      30.0  10.0
Row 4      40.0  10.0
a           NaN  10.0
b           NaN  20.0
c           NaN  30.0
d           NaN  40.0

<a id=23></a>
# Create a new column based on a condition

In [56]:
df4 = pd.DataFrame({'rating': [90, 85, 82, 88, 94, 90, 76, 75, 87, 86],
                   'points': [25, 20, 14, 16, 27, 20, 12, 15, 14, 19],
                   'assists': [5, 7, 7, 8, 5, 7, 6, 9, 9, 5],
                   'rebounds': [11, 8, 10, 6, 6, 9, 6, 10, 10, 7]})
df4

   rating  points  assists  rebounds
0      90      25        5        11
1      85      20        7         8
2      82      14        7        10
3      88      16        8         6
4      94      27        5         6
5      90      20        7         9
6      76      12        6         6
7      75      15        9        10
8      87      14        9        10
9      86      19        5         7

In [57]:
df4['Good'] = np.where(df4['points']>20, 'yes', 'no') # binary values
df4

   rating  points  assists  rebounds Good
0      90      25        5        11  yes
1      85      20        7         8   no
2      82      14        7        10   no
3      88      16        8         6   no
4      94      27        5         6  yes
5      90      20        7         9   no
6      76      12        6         6   no
7      75      15        9        10   no
8      87      14        9        10   no
9      86      19        5         7   no

In [58]:
# Create a New Column with Multiple Values
def f(row):
    if row['points'] < 15:
        val = 'no'
    elif row['points'] < 25:
        val = 'maybe'
    else:
        val = 'yes'
    return val
df4['Good'] = df4.apply(f, axis=1)
df4

   rating  points  assists  rebounds   Good
0      90      25        5        11    yes
1      85      20        7         8  maybe
2      82      14        7        10     no
3      88      16        8         6  maybe
4      94      27        5         6    yes
5      90      20        7         9  maybe
6      76      12        6         6     no
7      75      15        9        10  maybe
8      87      14        9        10     no
9      86      19        5         7  maybe

In [59]:
df4['assist_more'] = np.where(df4['assists']>df4['rebounds'], 'yes', 'no') # Based on Comparison with Existing Column
df4

   rating  points  assists  rebounds   Good assist_more
0      90      25        5        11    yes          no
1      85      20        7         8  maybe          no
2      82      14        7        10     no          no
3      88      16        8         6  maybe         yes
4      94      27        5         6    yes          no
5      90      20        7         9  maybe          no
6      76      12        6         6     no          no
7      75      15        9        10  maybe          no
8      87      14        9        10     no          no
9      86      19        5         7  maybe          no

In [60]:
df4['Good_dummy']=df4['Good'].map({'yes':2, 'maybe':1, 'no':0})
df4

   rating  points  assists  rebounds   Good assist_more  Good_dummy
0      90      25        5        11    yes          no           2
1      85      20        7         8  maybe          no           1
2      82      14        7        10     no          no           0
3      88      16        8         6  maybe         yes           1
4      94      27        5         6    yes          no           2
5      90      20        7         9  maybe          no           1
6      76      12        6         6     no          no           0
7      75      15        9        10  maybe          no           1
8      87      14        9        10     no          no           0
9      86      19        5         7  maybe          no           1

In [61]:
df4 = pd.get_dummies(df4, columns=['assist_more'], drop_first = True)
df4

   rating  points  assists  rebounds   Good  Good_dummy  assist_more_yes
0      90      25        5        11    yes           2                0
1      85      20        7         8  maybe           1                0
2      82      14        7        10     no           0                0
3      88      16        8         6  maybe           1                1
4      94      27        5         6    yes           2                0
5      90      20        7         9  maybe           1                0
6      76      12        6         6     no           0                0
7      75      15        9        10  maybe           1                0
8      87      14        9        10     no           0                0
9      86      19        5         7  maybe           1                0

<a id = 24></a>
# Count
## Count unique values

In [62]:
df4['assists'].unique() # shows unique values

array([5, 7, 8, 6, 9], dtype=int64)

In [63]:
df4['assists'].nunique() # counts how many unique values

5

In [64]:
df4['assists'].value_counts() # shows unique values and counts how many each has

7    3
5    3
9    2
8    1
6    1
Name: assists, dtype: int64

In [65]:
df4.groupby('assists').count() # same as above

         rating  points  rebounds  Good  Good_dummy  assist_more_yes
assists
5             3       3         3     3           3                3
6             1       1         1     1           1                1
7             3       3         3     3           3                3
8             1       1         1     1           1                1
9             2       2         2     2           2                2

<a id = 25></a>
## Count specific values

In [66]:
sum(df4['Good']=='yes') # how many have 'yes' in the 'Good' column

2

In [67]:
df4[df4['Good']=='yes'].count() # or .info()

rating             2
points             2
assists            2
rebounds           2
Good               2
Good_dummy         2
assist_more_yes    2
dtype: int64